import math                                                                                                         # import math เพื่อเรียกใช้ Function ในการถอดรากที่สอง
inputalpha = 0.05                                                                                                   # รับค่าระดับนัยสำตัญจากผู้ใช้ผ่าน Keyboard เก็บค่าเป็น Float(ตัวเลขที่มีจุดทศนิยม) ใน ตัวแปรที่ชื่อว่า inputalpha
alphaplusplus = 1.960                                                                                          # ประกาศตัวแปร alphaplusplus กำหนดค่าในตัวแปรเท่ากับ 0                                                                                   
Factory_A_data = [3350,3350,3220,3020,3250,3200,3070,3360,3170,3100,3400,2930,3300,3380,3210,3010,3260,3430,3130,3220,3570,3210,2930,3340,3410,3680,2980,3290,3130,3390,3440,3380,3210,3170,3300,3220,3570,3210,2930,3340,3410,3430,3690,3300,3630,3140,3140,3640,3310,3350,3350,3350,3220,3020,3250,3200,3070,3360,3170,3100,3400,2930,3300,3380,3210,3010,3260,3430,3130,3220,3570,3210,2930,3340,3350,3350,3220,3020,3250,3200,3070,3360,3170,3100,3400,2930,3300,3380,3210,3010,3260] # Data a
Factory_B_data = [3550,3520,3570,3760,3630,3400,3360,3190,3340,3680,3200,3640,3580,3300,3630,3140,3140,3640,3310,3350,3250,3320,3590,3650,3720,3500,3440,3590,3290,3130,3390,3440,3380,3210,3170,3300,3220,3570,3210,2930,3340,3410,3310,3350,3250,3320,3590,3650,3550,3520,3570,3760,3630,3400,3360,3190,3340,3680,3200,3640,3580,3270,3780,3430,3690,3300,3630,3140,3140,3350,3350,3220,3020,3250,3200,3070,3360,3170,3100,3400,2930,3300,3380,3210,3010,3260,3430] # Data b
Ga = 1820                                                                                                           # ซิกมา a 
Gb = 1730                                                                                                           # ซิกมา b
GaPowertwo = Ga*Ga                                                                                                  # ซิกมา a ยกกำลัง 2
GbPowertwo = Gb*Gb                                                                                                  # ซิกมา b ยกกำลัง 2
Na = len(Factory_A_data)                                                                                            # จำนวนสมาชิกของ a
Nb = len(Factory_B_data)                                                                                            # จำนวนสมาชิกของ b
Suma = 0                                                                                                            # สร้างตัวแปรมาเพื่อเก็บข้อมูลล่วงหน้า
Sumb = 0                                                                                                            # สร้างตัวแปรมาเพื่อเก็บข้อมูลล่วงหน้า
for i in range(len(Factory_A_data)):                                                                                # Loop for ตามจำนวนของสมาชิกใน list Factory_A_data
    Suma += Factory_A_data[i]                                                                                       # นำค่าใน Factery_A_data มาบวกกันทั้งหมดเก็บไว้ในตัวแปร Suma
for i in range(len(Factory_B_data)):                                                                                # Loop for ตามจำนวนของสมาชิกใน list Factory_B_data
    Sumb += Factory_B_data[i]                                                                                       # นำค่าใน Factery_B_data มาบวกกันทั้งหมดเก็บไว้ในตัวแปร Sumb
Xbar_a = Suma/Na                                                                                                    # นำค่่าในตัวแปร Suma (ผลรวมตัวเลขทั้งหมดใน list Factery_A_data) มาหารกับตัวแปร Na (จำนวนสมาชิกของ a) เก็บค่าผลหารในตัวแปร Xbar_a (ค่าเฉลี่ย a)
Xbar_b = Sumb/Nb                                                                                                    # นำค่่าในตัวแปร Sumb (ผลรวมตัวเลขทั้งหมดใน list Factery_B_data) มาหารกับตัวแปร Nb (จำนวนสมาชิกของ b) เก็บค่าผลหารในตัวแปร Xbar_b (ค่าเฉลี่ย b)
sumxbar = Xbar_a - Xbar_b                                                                                           # นำค่าในตัวแปร Xbar_a (ค่าเฉลี่ย a) มาลบกับ Xbar_b (ค่าเฉลี่ย b) เก็บค่าไว้ในตัวแปร sumxbar (ค่าด้านบนของสูตร)
HanhanA = GaPowertwo/Na                                                                                             # นำค่าในตัวแปร GaPowertwo (ซิกมา a ยกกำลัง 2) มาหารกับตัวแปร Na (จำนวนสมาชิกของ a) เก็บค่าผลหารไว้ในตัวแปร HanhanA (ค่าที่ต้องเอาไปบวกกับ HanhanB) เพื่อนำไปหาร sumxbar (ค่าด้านบนของสูตร) 
HanhanB = GbPowertwo/Nb                                                                                             # นำค่าในตัวแปร GbPowertwo (ซิกมา b ยกกำลัง 2) มาหารกับตัวแปร Nb (จำนวนสมาชิกของ b) เก็บค่าผลหารไว้ในตัวแปร HanhanB (ค่าที่ต้องเอาไปบวกกับ HanhanA) เพื่อนำไปหาร sumxbar (ค่าด้านบนของสูตร)
Sumhan = HanhanA + HanhanB                                                                                          # นำค่าในตัวแปร HanhanA (ค่าด้านล่างฝั่งซ้ายของสูตร) มาบวกกำจัวแปร HanhanB (ค่าด้านล่างฝั่งขวาของสูตร) เก็บไว้ในตัวแปร Sumhan (ค่าด้านล่างของสูตร)
HanHanHan = math.sqrt(Sumhan)                                                                                       # นำค่าในตัวแปร Sumhan (ค่าด้านล่างของสูตร) มาถอดรากที่สองโดยใช้ ฟังก์ชัน math.sqrt() เก็บค่าไว้ในตัวแปร HanHanHan (ค่าด้านล่างของสูตรที่ถอดสแควรูทเสร็จแล้ว)
Zcal = sumxbar / HanHanHan         
print("\nzigma a = ",GaPowertwo)
print("zigma b = ",GbPowertwo)
print("จำนวนสมาชิกของกลุ่มตัวอย่างของกลุ่ม A = ",Na)
print("จำนวนสมาชิกของกลุ่มตัวอย่างของกลุ่ม B = ",Nb)
print("Xbar a = ",Xbar_a)
print("Xbar b = ",Xbar_b)
print("_________________________")
print("\nระดับนัยสำคัญที่ 0.05") 
print("จุดวิกฤต = ",(alphaplusplus*-1),"ถึง",alphaplusplus)   
print("Zcal ที่คำนวณได้เท่ากับ ",Zcal)                                                                         
if Zcal <= (alphaplusplus*-1) or Zcal >= (alphaplusplus):                                                           # กำหนดเงื่อนไข ถ้าค่าในตัวแปร Zcal <= (alphaplusplus*-1) or Zcal >= (alphaplusplus) ให้ทำเงื่อนไขด้านล่าง
    print("สรุปผลการทดสอบ : ค่าตอบแทนต่อเดือนของคนงานในโรงงาน A และ B แตกต่างกันที่ระดับนัยสําคัญ",inputalpha,"\n")                   # แสดงผล "สรุปผลการทดสอบ : ค่าตอบแทนต่อเดือนของคนงานในโรงงาน A และ B แตกต่างกันที่ระดับนัยสําคัญ" inputalpha
else:                                                                                                               # กำหนดเงื่อนไข ถ้าไม่ได้ทำเงื่อนไขด้านบน ให้ทำเงื่อนไขด้านล่าง
    print("สรุปผลการทดสอบ : ค่าตอบแทนต่อเดือนของคนงานในโรงงาน A และ B ไม่แตกต่างกันที่ระดับนัยสําคัญ",inputalpha,"\n")                 # แสดงผล "สรุปผลการทดสอบ : ค่าตอบแทนต่อเดือนของคนงานในโรงงาน A และ B ไม่แตกต่างกันที่ระดับนัยสําคัญ" inputalpha
